#include <iostream>
#include <vector>
#include <string>
#include <algorithm>
#include "Colors.h"
#include "Text.h"
#include "Pictures.h"
using namespace std;
class Wallet {
protected:
    int Money_Dollars = 100;
public:
    Wallet() {
        this->Money_Dollars = Money_Dollars;
    }
    void Wallet1() {
        if (Money_Dollars < 70) {
            Money_Dollars++;
        }
        else {

        }
    }
};

class WINCHER : public Wallet {
    bool exit_is_WINCHER = 1;
    int choice_shop;
    int choice_shop_product;
    int choice_yes_or_no1;
    int choice_yes_or_no2;
    int choice_yes_or_no3;
    int choice_yes_or_no4;
    int choice_yes_or_no5;
    int choice_yes_or_no6;
    int choice_yes_or_no7;
    int choice_yes_or_no8;
public:
    void WINCHER_() {
        cout << "—————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————";
        cout << "\033[48;2;0;0;255m\n\n\n\t\t\t\t\t\t\t\t\t\t\t\t\tWINCHER est." << "\033[0m";
        cout << "\n\n\n—————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————";
        cout << "\n\n\t\t\t\t\t\t\t\t\t\t\t\t    \033[48;2;255;0;0mÀññîðòèìåíò ìàãàçèíà:\033[0m";
        cout << "\n\n\t\t\t\t\t\t\t\t\t\t\t       \033[38;5;15m\033[48;2;30;30;30mÊîëè÷åñòâî òîâàðîâ â ìàãàçèíå: 8\033[0m\033[0m";
        cout << "\n\n\t\t\t\t\t\t\t1)\033[38;2;255;0;255m ×èò - Îðóæèå! Ïàëêà          \033[0m   \033[38;2;255;225;0m[400 ðóá.]\033[0m \033[38;2;255;0;255m(äîíàò íà êàðòó)\033[0m";
        cout << "\n\t\t\t\t\t\t\t2) Êàñòåò HAIMARS                  \033[38;5;46m[9$]\033[0m";
        cout << "\n\t\t\t\t\t\t\t3) Íîæ SFN Version 1 (USN Mark 1)  \033[38;5;46m[42$]\033[0m";
        cout << "\n\t\t\t\t\t\t\t4) Ïèñòîëåò Colt 13Trophies        \033[38;5;46m[100$]\033[0m";
        cout << "\n\t\t\t\t\t\t\t5) Âèíòîâêà SF911 Autmnfield       \033[38;5;46m[150$]\033[0m";
        cout << "\n\t\t\t\t\t\t\t6) Ðåâîëüâåð NAHAN                 \033[38;5;46m[25$]\033[0m";
        cout << "\n\t\t\t\t\t\t\t7) Ïóëåì¸ò Ôàéåðñîí P-1921         \033[38;5;46m[210$]\033[0m";
        cout << "\n\t\t\t\t\t\t\t8) Ïóëåì¸ò Blackwing L687          \033[38;5;46m[235$]\033[0m";
        cout << "\n\n\n—————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————";

        while (exit_is_WINCHER = 1) {
            cout << "\n\n\t\t\t\t\t\t\t\033[48;2;0;0;255mÂûáåðèòå äåéñòâèå\033[0m \n\n\t\t\t\t\t\t\t[1] Óéòè \n\t\t\t\t\t\t\t[2] Âûáðàòü òîâàð äëÿ ïîêóïêè\n\n\t\t\t\t\t\t\t\033[48;2;255;0;0mÂàø âûáîð:\033[0m ";
            cin >> choice_shop;
            if (choice_shop == 1) {
                cout << "\n\t\t\t\t\t\t\tÄî ñâèäàíèÿ!\n\n\n\n\n";
                exit_is_WINCHER = 0;
                break;
            }
            else {
                cout << "\n\t\t\t\t\t\t\t×òî âû õîòèòå ïðèîáðåñòè? Ââåäèòå íîìåð òîâàðà èç ñïèñêà àññîðòèìåíòà ìàãàçèíà: ";
                cin >> choice_shop_product;
                switch (choice_shop_product) {
                case 1:
                    cout << "\n\t\t\t\t\t\t\tÂû âûáðàëè «×èò - Îðóæèå! Ïàëêà» ñòîèìîñòüþ 400 ðóáëåé. Âû óâåðåíû, ÷òî õîòèòå ïðèîáðåñòè ýòîò òîâàð? \n\n\t\t\t\t\t\t\t[1] Äà\n\t\t\t\t\t\t\t[2] Íåò\n\n\t\t\t\t\t\t\tÂàø âûáîð: ";
                    cin >> choice_yes_or_no1;
                    if (choice_yes_or_no1 == 1) {
                        if (Money_Dollars > 5) {
                            Money_Dollars -= 5;
                            cout << "\n\t\t\t\t\t\t\tÓñïåøíî! Âû ïðèîáðåëè «×èò - Îðóæèå! Ïàëêà»";
                        }
                        else {
                            cout << "\n\t\t\t\t\t\t\tÍåäîñòàòî÷íî ñðåäñòâ";
                        }
                        cout << "\n\n—————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————";
                    }
                    else {
                        break;
                    }
                    break;
                case 2:
                    cout << "\n\t\t\t\t\t\t\tÂû âûáðàëè «Êàñòåò HAIMARS» ñòîèìîñòüþ 9$. Âû óâåðåíû, ÷òî õîòèòå ïðèîáðåñòè ýòîò òîâàð? \n\n\t\t\t\t\t\t\t[1] Äà\n\t\t\t\t\t\t\t[2] Íåò\n\n\t\t\t\t\t\t\tÂàø âûáîð: ";
                    cin >> choice_yes_or_no2;
                    if (choice_yes_or_no2 == 1) {
                        if (Money_Dollars > 9) {
                            Money_Dollars -= 9;
                            cout << "\n\t\t\t\t\t\t\tÓñïåøíî! Âû ïðèîáðåëè «Êàñòåò HAIMARS»";
                        }
                        else {
                            cout << "\n\t\t\t\t\t\t\tÍåäîñòàòî÷íî ñðåäñòâ";
                        }

                        cout << "\n\n—————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————";
                    }
                    else {
                        break;
                    }
                    break;
                case 3:
                    cout << "\n\t\t\t\t\t\t\tÂû âûáðàëè «Íîæ SFN Version 1 (USN Mark 1)» ñòîèìîñòüþ 42$. Âû óâåðåíû, ÷òî õîòèòå ïðèîáðåñòè ýòîò òîâàð? \n\n\t\t\t\t\t\t\t[1] Äà\n\t\t\t\t\t\t\t[2] Íåò\n\n\t\t\t\t\t\t\tÂàø âûáîð: ";
                    cin >> choice_yes_or_no3;
                    if (choice_yes_or_no3 == 1) {
                        if (Money_Dollars > 42) {
                            Money_Dollars -= 42;
                            cout << "\n\t\t\t\t\t\t\tÓñïåøíî! Âû ïðèîáðåëè «Íîæ SFN Version 1 (USN Mark 1)»";
                        }
                        else {
                            cout << "\n\t\t\t\t\t\t\tÍåäîñòàòî÷íî ñðåäñòâ";
                        }

                        cout << "\n\n—————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————";
                    }
                    else {
                        break;
                    }
                    break;
                case 4:
                    cout << "\n\t\t\t\t\t\t\tÂû âûáðàëè «Ïèñòîëåò Colt 13Trophies» ñòîèìîñòüþ 100$. Âû óâåðåíû, ÷òî õîòèòå ïðèîáðåñòè ýòîò òîâàð? \n\n\t\t\t\t\t\t\t[1] Äà\n\t\t\t\t\t\t\t[2] Íåò\n\n\t\t\t\t\t\t\tÂàø âûáîð: ";
                    cin >> choice_yes_or_no4;
                    if (choice_yes_or_no4 == 1) {
                        if (Money_Dollars > 100) {
                            Money_Dollars -= 100;
                            cout << "\n\t\t\t\t\t\t\tÓñïåøíî! Âû ïðèîáðåëè «Ïèñòîëåò Colt 13Trophies»";
                        }
                        else {
                            cout << "\n\t\t\t\t\t\t\tÍåäîñòàòî÷íî ñðåäñòâ";
                        }
                        cout << "\n\n—————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————";
                    }
                    else {
                        break;
                    }
                    break;
                case 5:
                    cout << "\n\t\t\t\t\t\t\tÂû âûáðàëè «Âèíòîâêà SF911 Autmnfield» ñòîèìîñòüþ 150$. Âû óâåðåíû, ÷òî õîòèòå ïðèîáðåñòè ýòîò òîâàð? \n\n\t\t\t\t\t\t\t[1] Äà\n\t\t\t\t\t\t\t[2] Íåò\n\n\t\t\t\t\t\t\tÂàø âûáîð: ";
                    cin >> choice_yes_or_no5;
                    if (choice_yes_or_no5 == 1) {
                        if (Money_Dollars > 150) {
                            Money_Dollars -= 150;
                            cout << "\n\t\t\t\t\t\t\tÓñïåøíî! Âû ïðèîáðåëè «Âèíòîâêà SF911 Autmnfield»";
                        }
                        else {
                            cout << "\n\t\t\t\t\t\t\tÍåäîñòàòî÷íî ñðåäñòâ";
                        }

                        cout << "\n\n—————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————";
                    }
                    else {
                        break;
                    }
                    break;
                case 6:
                    cout << "\n\t\t\t\t\t\t\tÂû âûáðàëè «Ðåâîëüâåð NAHAN» ñòîèìîñòüþ 25$. Âû óâåðåíû, ÷òî õîòèòå ïðèîáðåñòè ýòîò òîâàð? \n\n\t\t\t\t\t\t\t[1] Äà\n\t\t\t\t\t\t\t[2] Íåò\n\n\t\t\t\t\t\t\tÂàø âûáîð: ";
                    cin >> choice_yes_or_no6;
                    if (choice_yes_or_no6 == 1) {
                        if (Money_Dollars > 25) {
                            Money_Dollars -= 25;
                            cout << "\n\t\t\t\t\t\t\tÓñïåøíî! Âû ïðèîáðåëè «Ðåâîëüâåð NAHAN»";
                        }
                        else {
                            cout << "\n\t\t\t\t\t\t\tÍåäîñòàòî÷íî ñðåäñòâ";
                        }

                        cout << "\n\n—————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————";
                    }
                    else {
                        break;
                    }
                    break;
                case 7:
                    cout << "\n\t\t\t\t\t\t\tÂû âûáðàëè «Ïóëåì¸ò Ôàéåðñîí P-1921» ñòîèìîñòüþ 210$. Âû óâåðåíû, ÷òî õîòèòå ïðèîáðåñòè ýòîò òîâàð? \n\n\t\t\t\t\t\t\t[1] Äà\n\t\t\t\t\t\t\t[2] Íåò\n\n\t\t\t\t\t\t\tÂàø âûáîð: ";
                    cin >> choice_yes_or_no7;
                    if (choice_yes_or_no7 == 1) {
                        if (Money_Dollars > 210) {
                            Money_Dollars -= 210;
                            cout << "\n\t\t\t\t\t\t\tÓñïåøíî! Âû ïðèîáðåëè «Ïóëåì¸ò Ôàéåðñîí P-1921»";
                        }
                        else {
                            cout << "\n\t\t\t\t\t\t\tÍåäîñòàòî÷íî ñðåäñòâ";
                        }

                        cout << "\n\n—————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————";
                    }
                    else {
                        break;
                    }
                    break;
                case 8:
                    cout << "\n\t\t\t\t\t\t\tÂû âûáðàëè «Ïóëåì¸ò Blackwing L687» ñòîèìîñòüþ 235$. Âû óâåðåíû, ÷òî õîòèòå ïðèîáðåñòè ýòîò òîâàð? \n\n\t\t\t\t\t\t\t[1] Äà\n\t\t\t\t\t\t\t[2] Íåò\n\n\t\t\t\t\t\t\tÂàø âûáîð: ";
                    cin >> choice_yes_or_no8;
                    if (choice_yes_or_no8 == 1) {
                        if (Money_Dollars > 235) {
                            Money_Dollars -= 235;
                            cout << "\n\t\t\t\t\t\t\tÓñïåøíî! Âû ïðèîáðåëè «Ïóëåì¸ò Blackwing L687»";
                        }
                        else {
                            cout << "\n\t\t\t\t\t\t\tÍåäîñòàòî÷íî ñðåäñòâ";
                        }

                        cout << "\n\n—————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————";
                    }
                    else {
                        break;
                    }
                    break;
                default:
                    cout << "\n\t\t\t\t\t\t\tÎøèáêà! Âåðîÿòíî, âû îïå÷àòàëèñü, íî ó íàñ íåòó òîâàðà ïîä òàêèì íîìåðîì â ñïèñêå àññîðòèìåíòà ìàãàçèíà.";
                    cout << "\n\n—————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————";
                }
            }
        }
    }
};




class HOUR_for_HOME : public Wallet {
    bool exit_is_HOUR_for_HOME = 1;
    int choice_shop1;
    int choice_shop_product1;
    int choice_yes_or_no9;
    int choice_yes_or_no10;
public:
    void HOUR_for_HOME_() {
        cout << "—————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————";
        cout << "\033[48;2;0;0;255m\n\n\n\t\t\t\t\t\t\t\t\t\t\t\t\tHOUR for HOME" << "\033[0m";
        cout << "\n\n\n—————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————";
        cout << "\n\n\t\t\t\t\t\t\t\t\t\t\t\t    \033[48;2;255;0;0mÀññîðòèìåíò ìàãàçèíà:\033[0m";
        cout << "\n\n\t\t\t\t\t\t\t\t\t\t\t       \033[38;5;15m\033[48;2;30;30;30mÊîëè÷åñòâî òîâàðîâ â ìàãàçèíå: 2\033[0m\033[0m";
        cout << "\n\t\t\t\t\t\t\t1) Èçîëåíòà       \033[38;5;46m[2$]\033[0m";
        cout << "\n\t\t\t\t\t\t\t2) Ñòåêëî         \033[38;5;46m[1$]\033[0m";
        cout << "\n\n\n—————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————";

        while (exit_is_HOUR_for_HOME = 1) {
            cout << "\n\n\t\t\t\t\t\t\t\033[48;2;0;0;255mÂûáåðèòå äåéñòâèå\033[0m \n\n\t\t\t\t\t\t\t[1] Óéòè \n\t\t\t\t\t\t\t[2] Âûáðàòü òîâàð äëÿ ïîêóïêè\n\n\t\t\t\t\t\t\t\033[48;2;255;0;0mÂàø âûáîð:\033[0m ";
            cin >> choice_shop1;
            if (choice_shop1 == 1) {
                cout << "\n\t\t\t\t\t\t\tÄî ñâèäàíèÿ!\n\n\n\n\n";
                exit_is_HOUR_for_HOME = 0;
                break;
            }
            else {
                cout << "\n\t\t\t\t\t\t\t×òî âû õîòèòå ïðèîáðåñòè? Ââåäèòå íîìåð òîâàðà èç ñïèñêà àññîðòèìåíòà ìàãàçèíà: ";
                cin >> choice_shop_product1;
                switch (choice_shop_product1) {
                case 1:
                    cout << "\n\t\t\t\t\t\t\tÂû âûáðàëè «Èçîëåíòà» ñòîèìîñòüþ 2$. Âû óâåðåíû, ÷òî õîòèòå ïðèîáðåñòè ýòîò òîâàð? \n\n\t\t\t\t\t\t\t[1] Äà\n\t\t\t\t\t\t\t[2] Íåò\n\n\t\t\t\t\t\t\tÂàø âûáîð: ";
                    cin >> choice_yes_or_no9;
                    if (choice_yes_or_no9 == 1) {
                        if (Money_Dollars > 2) {
                            Money_Dollars -= 2;
                            cout << "\n\t\t\t\t\t\t\tÓñïåøíî! Âû ïðèîáðåëè «Èçîëåíòà»";
                        }
                        else {
                            cout << "\n\t\t\t\t\t\t\tÍåäîñòàòî÷íî ñðåäñòâ";
                        }

                        cout << "\n\n—————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————";
                    }
                    else {
                        break;
                    }
                    break;
                case 2:
                    cout << "\n\t\t\t\t\t\t\tÂû âûáðàëè «Ñòåêëî» ñòîèìîñòüþ 1$. Âû óâåðåíû, ÷òî õîòèòå ïðèîáðåñòè ýòîò òîâàð? \n\n\t\t\t\t\t\t\t[1] Äà\n\t\t\t\t\t\t\t[2] Íåò\n\n\t\t\t\t\t\t\tÂàø âûáîð: ";
                    cin >> choice_yes_or_no10;
                    if (choice_yes_or_no10 == 1) {
                        if (Money_Dollars > 1) {
                            Money_Dollars -= 1;
                            cout << "\n\t\t\t\t\t\t\tÓñïåøíî! Âû ïðèîáðåëè «Ñòåêëî»";
                        }
                        else {
                            cout << "\n\t\t\t\t\t\t\tÍåäîñòàòî÷íî ñðåäñòâ";
                        }

                        cout << "\n\n—————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————";
                    }
                    else {
                        break;
                    }
                    break;
                default:
                    cout << "\n\t\t\t\t\t\t\tÎøèáêà! Âåðîÿòíî, âû îïå÷àòàëèñü, íî ó íàñ íåòó òîâàðà ïîä òàêèì íîìåðîì â ñïèñêå àññîðòèìåíòà ìàãàçèíà.";
                    cout << "\n\n—————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————";
                }
            }
        }
    }
};



class WERLOCK_FARMACY : public Wallet {
    bool exit_is_WERLOCK_FARMACY = 1;
    int choice_shop2;
    int choice_shop_product2;
    int choice_yes_or_no11;
    int choice_yes_or_no12;
    int choice_yes_or_no13;
    int choice_yes_or_no14;
    int choice_yes_or_no15;
    int choice_yes_or_no16;
public:
    void WERLOCK_FARMACY_() {
        cout << "—————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————";
        cout << "\033[48;2;0;0;255m\n\n\n\t\t\t\t\t\t\t\t\t\t\t\t\tWERLOCK FARMACY" << "\033[0m";
        cout << "\n\n\n—————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————";
        cout << "\n\n\t\t\t\t\t\t\t\t\t\t\t\t    \033[48;2;255;0;0mÀññîðòèìåíò ìàãàçèíà:\033[0m";
        cout << "\n\n\t\t\t\t\t\t\t\t\t\t\t       \033[38;5;15m\033[48;2;30;30;30mÊîëè÷åñòâî òîâàðîâ â ìàãàçèíå: 6\033[0m\033[0m";
        cout << "\n\t\t\t\t\t\t\t1) Ìèêñòóðà Belladonna             \033[38;5;46m[5$]\033[0m";
        cout << "\n\t\t\t\t\t\t\t2) Òàáëåòêè Asp.VENOMUS            \033[38;5;46m[2$]\033[0m";
        cout << "\n\t\t\t\t\t\t\t3) Ñèðîï Mercurios                 \033[38;5;46m[1.5$]\033[0m";
        cout << "\n\t\t\t\t\t\t\t4) Áèíò                            \033[38;5;46m[0.9$]\033[0m";
        cout << "\n\t\t\t\t\t\t\t5) Îáåçáîëèâàþùèå Tetanu           \033[38;5;46m[1.2$]\033[0m";
        cout << "\n\t\t\t\t\t\t\t6) Èíúåêöèÿ Novic                  \033[38;5;46m[2.5$]\033[0m";
        cout << "\n\n\n—————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————";

        while (exit_is_WERLOCK_FARMACY = 1) {
            cout << "\n\n\t\t\t\t\t\t\t\033[48;2;0;0;255mÂûáåðèòå äåéñòâèå\033[0m \n\n\t\t\t\t\t\t\t[1] Óéòè \n\t\t\t\t\t\t\t[2] Âûáðàòü òîâàð äëÿ ïîêóïêè\n\n\t\t\t\t\t\t\t\033[48;2;255;0;0mÂàø âûáîð:\033[0m ";
            cin >> choice_shop2;
            if (choice_shop2 == 1) {
                cout << "\n\t\t\t\t\t\t\tÄî ñâèäàíèÿ!\n\n\n\n\n";
                exit_is_WERLOCK_FARMACY = 0;
                break;
            }
            else {
                cout << "\n\t\t\t\t\t\t\t×òî âû õîòèòå ïðèîáðåñòè? Ââåäèòå íîìåð òîâàðà èç ñïèñêà àññîðòèìåíòà ìàãàçèíà: ";
                cin >> choice_shop_product2;
                switch (choice_shop_product2) {
                case 1:
                    cout << "\n\t\t\t\t\t\t\tÂû âûáðàëè «Ìèêñòóðà Belladonna» ñòîèìîñòüþ 5$. Âû óâåðåíû, ÷òî õîòèòå ïðèîáðåñòè ýòîò òîâàð? \n\n\t\t\t\t\t\t\t[1] Äà\n\t\t\t\t\t\t\t[2] Íåò\n\n\t\t\t\t\t\t\tÂàø âûáîð: ";
                    cin >> choice_yes_or_no11;
                    if (choice_yes_or_no11 == 1) {
                        if (Money_Dollars > 5) {
                            Money_Dollars -= 5;
                            cout << "\n\t\t\t\t\t\t\tÓñïåøíî! Âû ïðèîáðåëè «Ìèêñòóðà Belladonna»";
                        }
                        else {
                            cout << "\n\t\t\t\t\t\t\tÍåäîñòàòî÷íî ñðåäñòâ";
                        }

                        cout << "\n\n—————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————";
                    }
                    else {
                        break;
                    }
                    break;
                case 2:
                    cout << "\n\t\t\t\t\t\t\tÂû âûáðàëè «Òàáëåòêè Asp.VENOMUS» ñòîèìîñòüþ 2$. Âû óâåðåíû, ÷òî õîòèòå ïðèîáðåñòè ýòîò òîâàð? \n\n\t\t\t\t\t\t\t[1] Äà\n\t\t\t\t\t\t\t[2] Íåò\n\n\t\t\t\t\t\t\tÂàø âûáîð: ";
                    cin >> choice_yes_or_no12;
                    if (choice_yes_or_no12 == 1) {
                        if (Money_Dollars > 2) {
                            Money_Dollars -= 2;
                            cout << "\n\t\t\t\t\t\t\tÓñïåøíî! Âû ïðèîáðåëè «Òàáëåòêè Asp.VENOMUS»";
                        }
                        else {
                            cout << "\n\t\t\t\t\t\t\tÍåäîñòàòî÷íî ñðåäñòâ";
                        }

                        cout << "\n\n—————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————";
                    }
                    else {
                        break;
                    }
                    break;
                case 3:
                    cout << "\n\t\t\t\t\t\t\tÂû âûáðàëè «Ñèðîï Mercurios» ñòîèìîñòüþ 1.5$. Âû óâåðåíû, ÷òî õîòèòå ïðèîáðåñòè ýòîò òîâàð? \n\n\t\t\t\t\t\t\t[1] Äà\n\t\t\t\t\t\t\t[2] Íåò\n\n\t\t\t\t\t\t\tÂàø âûáîð: ";
                    cin >> choice_yes_or_no13;
                    if (choice_yes_or_no13 == 1) {
                        if (Money_Dollars > 1.5) {
                            Money_Dollars -= 1.5;
                            cout << "\n\t\t\t\t\t\t\tÓñïåøíî! Âû ïðèîáðåëè «Ñèðîï Mercurios»";
                        }
                        else {
                            cout << "\n\t\t\t\t\t\t\tÍåäîñòàòî÷íî ñðåäñòâ";
                        }

                        cout << "\n\n—————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————";
                    }
                    else {
                        break;
                    }
                    break;
                case 4:
                    cout << "\n\t\t\t\t\t\t\tÂû âûáðàëè «Áèíò» ñòîèìîñòüþ 0.9$. Âû óâåðåíû, ÷òî õîòèòå ïðèîáðåñòè ýòîò òîâàð? \n\n\t\t\t\t\t\t\t[1] Äà\n\t\t\t\t\t\t\t[2] Íåò\n\n\t\t\t\t\t\t\tÂàø âûáîð: ";
                    cin >> choice_yes_or_no14;
                    if (choice_yes_or_no14 == 1) {
                        if (Money_Dollars > 0.9) {
                            Money_Dollars -= 0.9;
                            cout << "\n\t\t\t\t\t\t\tÓñïåøíî! Âû ïðèîáðåëè «Áèíò»";
                        }
                        else {
                            cout << "\n\t\t\t\t\t\t\tÍåäîñòàòî÷íî ñðåäñòâ";
                        }

                        cout << "\n\n—————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————";
                    }
                    else {
                        break;
                    }
                    break;
                case 5:
                    cout << "\n\t\t\t\t\t\t\tÂû âûáðàëè «Îáåçáîëèâàþùèå Tetanu» ñòîèìîñòüþ 1.2$. Âû óâåðåíû, ÷òî õîòèòå ïðèîáðåñòè ýòîò òîâàð? \n\n\t\t\t\t\t\t\t[1] Äà\n\t\t\t\t\t\t\t[2] Íåò\n\n\t\t\t\t\t\t\tÂàø âûáîð: ";
                    cin >> choice_yes_or_no15;
                    if (choice_yes_or_no15 == 1) {
                        if (Money_Dollars > 1.2) {
                            Money_Dollars -= 1.2;
                            cout << "\n\t\t\t\t\t\t\tÓñïåøíî! Âû ïðèîáðåëè «Îáåçáîëèâàþùèå Tetanu»";
                        }
                        else {
                            cout << "\n\t\t\t\t\t\t\tÍåäîñòàòî÷íî ñðåäñòâ";
                        }

                        cout << "\n\n—————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————";
                    }
                    else {
                        break;
                    }
                    break;
                case 6:
                    cout << "\n\t\t\t\t\t\t\tÂû âûáðàëè «Èíúåêöèÿ Novic» ñòîèìîñòüþ 2.5$. Âû óâåðåíû, ÷òî õîòèòå ïðèîáðåñòè ýòîò òîâàð? \n\n\t\t\t\t\t\t\t[1] Äà\n\t\t\t\t\t\t\t[2] Íåò\n\n\t\t\t\t\t\t\tÂàø âûáîð: ";
                    cin >> choice_yes_or_no16;
                    if (choice_yes_or_no16 == 1) {
                        if (Money_Dollars > 2.5) {
                            Money_Dollars -= 2.5;
                            cout << "\n\t\t\t\t\t\t\tÓñïåøíî! Âû ïðèîáðåëè «Èíúåêöèÿ Novic»";
                        }
                        else {
                            cout << "\n\t\t\t\t\t\t\tÍåäîñòàòî÷íî ñðåäñòâ";
                        }

                        cout << "\n\n—————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————";
                    }
                    else {
                        break;
                    }
                    break;
                default:
                    cout << "\n\t\t\t\t\t\t\tÎøèáêà! Âåðîÿòíî, âû îïå÷àòàëèñü, íî ó íàñ íåòó òîâàðà ïîä òàêèì íîìåðîì â ñïèñêå àññîðòèìåíòà ìàãàçèíà.";
                    cout << "\n\n—————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————";
                }
            }
        }
    }
};



class Nelegal : public Wallet {
    bool exit_is_Nelegal = 1;
    int choice_shop3;
    int choice_shop_product3;
    int choice_yes_or_no17;
    int choice_yes_or_no18;
    int choice_yes_or_no19;
    int choice_yes_or_no20;
    int choice_yes_or_no21;
    int choice_yes_or_no22;
public:
    void Nelegal_() {
        cout << "—————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————";
        cout << "\033[48;2;0;0;255m\n\n\n\t\t\t\t\t\t\t\t\t\t\t\t\tÍÅËÅÃÀËÜÍÀß ÒÎÐÃÎÂËß" << "\033[0m";
        cout << "\n\n\n—————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————";
        cout << "\n\n\t\t\t\t\t\t\t\t\t\t\t\t    \033[48;2;255;0;0mÀññîðòèìåíò ìàãàçèíà:\033[0m";
        cout << "\n\n\t\t\t\t\t\t\t\t\t\t\t       \033[38;5;15m\033[48;2;30;30;30mÊîëè÷åñòâî òîâàðîâ â ìàãàçèíå: 6\033[0m\033[0m";
        cout << "\n\t\t\t\t\t\t\t1) Àáñåíò Ñ++Ñ íà ïëÿæå            \033[38;5;46m[14.48$]\033[0m";
        cout << "\n\t\t\t\t\t\t\t2) Âèñêè Atlantica                 \033[38;5;46m[1.5$]\033[0m";
        cout << "\n\t\t\t\t\t\t\t3) Òåêèëà Pablo's                  \033[38;5;46m[1.25$]\033[0m";
        cout << "\n\t\t\t\t\t\t\t4) Âèíî Imp¸rium Stol'tzs          \033[38;5;46m[1$]\033[0m";
        cout << "\n\t\t\t\t\t\t\t5) Âîäêà Victory                   \033[38;5;46m[0.7$]\033[0m";
        cout << "\n\t\t\t\t\t\t\t6) Ïèâî De' Buff                   \033[38;5;46m[0.4$]\033[0m";
        cout << "\n\n\n—————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————";

        while (exit_is_Nelegal = 1) {
            cout << "\n\n\t\t\t\t\t\t\t\033[48;2;0;0;255mÂûáåðèòå äåéñòâèå\033[0m \n\n\t\t\t\t\t\t\t[1] Óéòè \n\t\t\t\t\t\t\t[2] Âûáðàòü òîâàð äëÿ ïîêóïêè\n\n\t\t\t\t\t\t\t\033[48;2;255;0;0mÂàø âûáîð:\033[0m ";
            cin >> choice_shop3;
            if (choice_shop3 == 1) {
                cout << "\n\t\t\t\t\t\t\tÄî ñâèäàíèÿ!\n\n\n\n\n";
                exit_is_Nelegal = 0;
                break;
            }
            else {
                cout << "\n\t\t\t\t\t\t\t×òî âû õîòèòå ïðèîáðåñòè? Ââåäèòå íîìåð òîâàðà èç ñïèñêà àññîðòèìåíòà ìàãàçèíà: ";
                cin >> choice_shop_product3;
                switch (choice_shop_product3) {
                case 1:
                    cout << "\n\t\t\t\t\t\t\tÂû âûáðàëè «Àáñåíò Ñ++Ñ íà ïëÿæå» ñòîèìîñòüþ 14.48$. Âû óâåðåíû, ÷òî õîòèòå ïðèîáðåñòè ýòîò òîâàð? \n\n\t\t\t\t\t\t\t[1] Äà\n\t\t\t\t\t\t\t[2] Íåò\n\n\t\t\t\t\t\t\tÂàø âûáîð: ";
                    cin >> choice_yes_or_no17;
                    if (choice_yes_or_no17 == 1) {
                        if (Money_Dollars > 14.48) {
                            Money_Dollars -= 14.48;
                            cout << "\n\t\t\t\t\t\t\tÓñïåøíî! Âû ïðèîáðåëè «Àáñåíò Ñ++Ñ íà ïëÿæå»";
                        }
                        else {
                            cout << "\n\t\t\t\t\t\t\tÍåäîñòàòî÷íî ñðåäñòâ";
                        }

                        cout << "\n\n—————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————";
                    }
                    else {
                        break;
                    }
                    break;
                case 2:
                    cout << "\n\t\t\t\t\t\t\tÂû âûáðàëè «Âèñêè Atlantica» ñòîèìîñòüþ 1.5$. Âû óâåðåíû, ÷òî õîòèòå ïðèîáðåñòè ýòîò òîâàð? \n\n\t\t\t\t\t\t\t[1] Äà\n\t\t\t\t\t\t\t[2] Íåò\n\n\t\t\t\t\t\t\tÂàø âûáîð: ";
                    cin >> choice_yes_or_no18;
                    if (choice_yes_or_no18 == 1) {
                        if (Money_Dollars > 1.5) {
                            Money_Dollars -= 1.5;
                            cout << "\n\t\t\t\t\t\t\tÓñïåøíî! Âû ïðèîáðåëè «Âèñêè Atlantica»";
                        }
                        else {
                            cout << "\n\t\t\t\t\t\t\tÍåäîñòàòî÷íî ñðåäñòâ";
                        }
                        cout << "\n\n—————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————";
                    }
                    else {
                        break;
                    }
                    break;
                case 3:
                    cout << "\n\t\t\t\t\t\t\tÂû âûáðàëè «Òåêèëà Pablo's» ñòîèìîñòüþ 1.25$. Âû óâåðåíû, ÷òî õîòèòå ïðèîáðåñòè ýòîò òîâàð? \n\n\t\t\t\t\t\t\t[1] Äà\n\t\t\t\t\t\t\t[2] Íåò\n\n\t\t\t\t\t\t\tÂàø âûáîð: ";
                    cin >> choice_yes_or_no19;
                    if (choice_yes_or_no19 == 1) {
                        if (Money_Dollars > 1.25) {
                            Money_Dollars -= 1.25;
                            cout << "\n\t\t\t\t\t\t\tÓñïåøíî! Âû ïðèîáðåëè «Òåêèëà Pablo's»";
                        }
                        else {
                            cout << "\n\t\t\t\t\t\t\tÍåäîñòàòî÷íî ñðåäñòâ";
                        }
                        cout << "\n\n—————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————";
                    }
                    else {
                        break;
                    }
                    break;
                case 4:
                    cout << "\n\t\t\t\t\t\t\tÂû âûáðàëè «Âèíî Imp¸rium Stol'tzs» ñòîèìîñòüþ 1$. Âû óâåðåíû, ÷òî õîòèòå ïðèîáðåñòè ýòîò òîâàð? \n\n\t\t\t\t\t\t\t[1] Äà\n\t\t\t\t\t\t\t[2] Íåò\n\n\t\t\t\t\t\t\tÂàø âûáîð: ";
                    cin >> choice_yes_or_no20;
                    if (choice_yes_or_no20 == 1) {
                        if (Money_Dollars > 1) {
                            Money_Dollars -= 1;
                            cout << "\n\t\t\t\t\t\t\tÓñïåøíî! Âû ïðèîáðåëè «Âèíî Imp¸rium Stol'tzs»";
                        }
                        else {
                            cout << "\n\t\t\t\t\t\t\tÍåäîñòàòî÷íî ñðåäñòâ";
                        }
                        cout << "\n\n—————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————";
                    }
                    else {
                        break;
                    }
                    break;
                case 5:
                    cout << "\n\t\t\t\t\t\t\tÂû âûáðàëè «Âîäêà Victory» ñòîèìîñòüþ 0.7$. Âû óâåðåíû, ÷òî õîòèòå ïðèîáðåñòè ýòîò òîâàð? \n\n\t\t\t\t\t\t\t[1] Äà\n\t\t\t\t\t\t\t[2] Íåò\n\n\t\t\t\t\t\t\tÂàø âûáîð: ";
                    cin >> choice_yes_or_no21;
                    if (choice_yes_or_no21 == 1) {
                        if (Money_Dollars > 0.7) {
                            Money_Dollars -= 0.7;
                            cout << "\n\t\t\t\t\t\t\tÓñïåøíî! Âû ïðèîáðåëè «Âîäêà Victory»";
                        }
                        else {
                            cout << "\n\t\t\t\t\t\t\tÍåäîñòàòî÷íî ñðåäñòâ";
                        }
                        cout << "\n\n—————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————";
                    }
                    else {
                        break;
                    }
                    break;
                case 6:
                    cout << "\n\t\t\t\t\t\t\tÂû âûáðàëè «Ïèâî De' Buff» ñòîèìîñòüþ 0.4$. Âû óâåðåíû, ÷òî õîòèòå ïðèîáðåñòè ýòîò òîâàð? \n\n\t\t\t\t\t\t\t[1] Äà\n\t\t\t\t\t\t\t[2] Íåò\n\n\t\t\t\t\t\t\tÂàø âûáîð: ";
                    cin >> choice_yes_or_no22;
                    if (choice_yes_or_no22 == 1) {
                        if (Money_Dollars > 0.4) {
                            Money_Dollars -= 0.4;
                            cout << "\n\t\t\t\t\t\t\tÓñïåøíî! Âû ïðèîáðåëè «Ïèâî De' Buff»";
                        }
                        else {
                            cout << "\n\t\t\t\t\t\t\tÍåäîñòàòî÷íî ñðåäñòâ";
                        }
                        cout << "\n\n—————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————";
                    }
                    else {
                        break;
                    }
                    break;
                default:
                    cout << "\n\t\t\t\t\t\t\tÎøèáêà! Âåðîÿòíî, âû îïå÷àòàëèñü, íî ó íàñ íåòó òîâàðà ïîä òàêèì íîìåðîì â ñïèñêå àññîðòèìåíòà ìàãàçèíà.";
                    cout << "\n\n—————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————";
                }
            }
        }
    }
};

void StoreWincher() {
    WINCHER obj;
    Wallet* ptr = &obj;
    obj.Wallet1();
    obj.WINCHER_();
}

void StoreHOUR() {
    HOUR_for_HOME obj;
    Wallet* ptr = &obj;
    obj.Wallet1();
    obj.HOUR_for_HOME_();
}

void StoreWERLOCK() {
    WERLOCK_FARMACY obj;
    Wallet* ptr = &obj;
    obj.Wallet1();
    obj.WERLOCK_FARMACY_();
}

void StoreNelegal() {
    Nelegal obj;
    Wallet* ptr = &obj;
    obj.Wallet1();
    obj.Nelegal_();
}
